/******************************************************************************,

                  版权所有 (C), 2009-2020, 青岛海汇德电气有限公司

 ******************************************************************************
  文 件 名   : fcm_temp.h
  版 本 号   : 初稿
  作    者   :LLXH
  生成日期   : 2022年1月11日
  最近修改   :
  功能描述   :  fcm_adc.c头文件
  函数列表   :

  修改历史   :
  1.日    期   : 2022年1月11日
    作    者   : LLXH
    修改内容   : 创建文件

******************************************************************************/
#ifndef APPLICATIONS_FCM_ADC_H_
#define APPLICATIONS_FCM_ADC_H_
#ifdef __cplusplus
extern "C"{
#endif /* __cplusplus */
/*----------------------------------------------*
 * 包含头文件                                        *
 *----------------------------------------------*/
#include "rtdevice.h"
#include "stm32f1xx_hal.h"
#include "board.h"
/*----------------------------------------------*
 * 宏定义                                          *
 *----------------------------------------------*/
/*FCM ADC采集通道数量*/
#define FCM_ADC_CHANNEL_NUM     3

/*----------------------------------------------*
 * 枚举类型定义                                       *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 结构体定义                                        *
 *----------------------------------------------*/

/*----------------------------------------------*
 * 内部函数原型说明（可供外部使用）                             *
 *----------------------------------------------*/
extern void adc_init(void);
extern void ADC_Calibration(void);
extern rt_uint32_t get_adc_value(rt_uint8_t Channel,rt_uint8_t average);

/*----------------------------------------------*
 * 内部变量原型说明（可供外部使用）                             *
 *----------------------------------------------*/


#ifdef __cplusplus
}
#endif
#endif /* APPLICATIONS_FCM_ADC_H_ */
